app/Controllers/Lapangan.php

    public function index()
    {
        $model = new LapanganModel();
        $data = [
            'title' => 'Daftar Lapangan',
            'page' => 'Lapangan',
            'content' => 'admin/lapangan/v_lapangan',
            'lapangan' => $model->findAll(),
---
SELECT *
FROM `t_lapangan`