app/Models/UserModel.php

  public function get_data()
  {
      return $this->findAll(); // Mengambil semua data dari tabel 'users'
---
SELECT *
FROM `users`